Jchisholm204/Gentry/STM32_reference/embos/template_f4/BoardSupport/Renesas/R7F0E01_RE01_256KB/DeviceSupport/startup_RE01_256KB.c
/***********************************************************************************************************************
 * DISCLAIMER
 * This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products. No
 * other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all
 * applicable laws, including copyright laws.
 * THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
 * THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM
 * EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES
 * SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO THIS
 * SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of
 * this software. By using this software, you agree to the additional terms and conditions found by accessing the
 * following link:
 * http://www.renesas.com/disclaimer
 *
 * Copyright (C) 2019 Renesas Electronics Corporation. All rights reserved.
 **********************************************************************************************************************/
/***********************************************************************************************************************
 * File Name    : startup_RE01_256KB.c
 * Version      : 0.40
 * Description  : CMSIS Cortex-M# Core Device Startup File for Device <RE01_256KB>
 **********************************************************************************************************************/
/***********************************************************************************************************************
 * History : DD.MM.YYYY Version  Description
 *         : 25.10.2019 0.40     First release
 **********************************************************************************************************************/
/******************************************************************************
 *
 * This file contains an interrupt vector for Cortex-M written in C.
 * The actual interrupt functions must be provided by the application developer.
 *
 * Copyright 2007-2017 IAR Systems AB.
 *
 * $Revision: 112610 $
 *
 ******************************************************************************/

/*******************************************************************************************************************//**
 * @addtogroup grp_cmsis_core
 * @{
 **********************************************************************************************************************/

/*------------------------------------------------------------------------------
 * Include
 *----------------------------------------------------------------------------*/
#include <stdint.h>

/*------------------------------------------------------------------------------
 * Macro
 *----------------------------------------------------------------------------*/
#if defined(__ICCARM__)                  /* IAR Compiler */
#define NON_VOLATILE  __root             /* @suppress("Internal macro naming") */ /* @suppress("Macro expansion") */
#elif defined(__GNUC__)                  /* GCC Compiler */
#define NON_VOLATILE                     /* @suppress("Internal macro naming") */ /* @suppress("Non-block comment") */
#else
#error "That compiler is not supported in this release."
#endif

/*------------------------------------------------------------------------------
 * Pragma
 *----------------------------------------------------------------------------*/
#if defined(__ICCARM__)                  /* IAR Compiler */
#pragma language=extended
#pragma segment="CSTACK"
#endif

/*------------------------------------------------------------------------------
 * Imported global variables and functions (from other files)
 *----------------------------------------------------------------------------*/
extern void Reset_Handler( void );       /* @suppress("Source line ordering") */ /* @suppress("Internal function declaration") */

extern void NMI_Handler( void );         /* @suppress("Internal function declaration") */
extern void HardFault_Handler( void );   /* @suppress("Internal function declaration") */
/* extern void MemManage_Handler( void );  */ /* Not in M0+ */ /* @suppress("Block comment") */ /* @suppress("Non-block comment") */
/* extern void BusFault_Handler( void );   */ /* Not in M0+ */
/* extern void UsageFault_Handler( void ); */ /* Not in M0+ */
extern void SVC_Handler( void );         /* @suppress("Internal function declaration") */
/* extern void DebugMon_Handler( void );   */ /* Not in M0+ */ /* @suppress("Block comment") */ /* @suppress("Non-block comment") */
extern void PendSV_Handler( void );      /* @suppress("Internal function declaration") */
extern void SysTick_Handler( void );     /* @suppress("Internal function declaration") */

extern void IEL0_IRQHandler( void );     /* @suppress("Internal function declaration") */
extern void IEL1_IRQHandler( void );     /* @suppress("Internal function declaration") */
extern void IEL2_IRQHandler( void );     /* @suppress("Internal function declaration") */
extern void IEL3_IRQHandler( void );     /* @suppress("Internal function declaration") */
extern void IEL4_IRQHandler( void );     /* @suppress("Internal function declaration") */
extern void IEL5_IRQHandler( void );     /* @suppress("Internal function declaration") */
extern void IEL6_IRQHandler( void );     /* @suppress("Internal function declaration") */
extern void IEL7_IRQHandler( void );     /* @suppress("Internal function declaration") */
extern void IEL8_IRQHandler( void );     /* @suppress("Internal function declaration") */
extern void IEL9_IRQHandler( void );     /* @suppress("Internal function declaration") */
extern void IEL10_IRQHandler( void );    /* @suppress("Internal function declaration") */
extern void IEL11_IRQHandler( void );    /* @suppress("Internal function declaration") */
extern void IEL12_IRQHandler( void );    /* @suppress("Internal function declaration") */
extern void IEL13_IRQHandler( void );    /* @suppress("Internal function declaration") */
extern void IEL14_IRQHandler( void );    /* @suppress("Internal function declaration") */
extern void IEL15_IRQHandler( void );    /* @suppress("Internal function declaration") */
extern void IEL16_IRQHandler( void );    /* @suppress("Internal function declaration") */
extern void IEL17_IRQHandler( void );    /* @suppress("Internal function declaration") */
extern void IEL18_IRQHandler( void );    /* @suppress("Internal function declaration") */
extern void IEL19_IRQHandler( void );    /* @suppress("Internal function declaration") */
extern void IEL20_IRQHandler( void );    /* @suppress("Internal function declaration") */
extern void IEL21_IRQHandler( void );    /* @suppress("Internal function declaration") */
extern void IEL22_IRQHandler( void );    /* @suppress("Internal function declaration") */
extern void IEL23_IRQHandler( void );    /* @suppress("Internal function declaration") */
extern void IEL24_IRQHandler( void );    /* @suppress("Internal function declaration") */
extern void IEL25_IRQHandler( void );    /* @suppress("Internal function declaration") */
extern void IEL26_IRQHandler( void );    /* @suppress("Internal function declaration") */
extern void IEL27_IRQHandler( void );    /* @suppress("Internal function declaration") */
extern void IEL28_IRQHandler( void );    /* @suppress("Internal function declaration") */
extern void IEL29_IRQHandler( void );    /* @suppress("Internal function declaration") */
extern void IEL30_IRQHandler( void );    /* @suppress("Internal function declaration") */
extern void IEL31_IRQHandler( void );    /* @suppress("Internal function declaration") */

extern void SystemInit (void);           /* @suppress("Internal function declaration") */
extern void __iar_program_start (void);  /* @suppress("Internal function declaration") */

