Jchisholm204/Gentry/STM32_reference/embos/template_f4/BoardSupport/Renesas/R7F0E01_RE01_256KB/DeviceSupport/startup_RE01_256KB.c
#if defined(__GNUC__)                    /* GCC Compiler */
extern uint32_t __etext;                 /* @suppress("Source line ordering") */
extern uint32_t __data_start__;
extern uint32_t __data_end__;
extern uint32_t __bss_start__;
extern uint32_t __bss_end__;

extern int main();                       /* @suppress("Non-portable variable type") */
#endif

/*------------------------------------------------------------------------------
 * Typedef
 *----------------------------------------------------------------------------*/
typedef void( *intfunc )( void );        /* @suppress("Source line ordering") */
typedef union { intfunc __fun; void * __ptr; } intvec_elem; /* @suppress("Data type member naming") */ /* @suppress("Data type naming") */
#if defined(__GNUC__)                    /* GCC Compiler */
#define SYSTEM_CFG_STACK_SIZE  (0x400)   /* @suppress("Internal macro naming") */ /* @suppress("Non-block comment") */
NON_VOLATILE uint8_t g_main_stack[SYSTEM_CFG_STACK_SIZE] __attribute__ ((section(".stack"))) __attribute__ ((aligned (8))) = {0U};
#else
#endif
/*------------------------------------------------------------------------------
 * Vector table
 *----------------------------------------------------------------------------*/
const intvec_elem _vectors[] __attribute__ ((section(".intvec"))) = /*  Exception no.     */
{
#if defined(__ICCARM__)              /* IAR Compiler */
    { .__ptr = __sfe( "CSTACK" ) },  /*  0 - Stack pointer */
#elif defined(__GNUC__)              /* GCC Compiler */
    { .__ptr = (&g_main_stack[0] + SYSTEM_CFG_STACK_SIZE) },              /* @suppress("Operand parentheses") */
#endif
    Reset_Handler,                   /*  1 - Reset vector  */
    /* Cortex-M0+ */                 /* @suppress("Block comment") */ /* @suppress("Non-block comment") */
    NMI_Handler,                     /*  2 - NMI           */
    HardFault_Handler,               /*  3 - HardFault     */
    0,                               /*  4 - Reserved      */
    0,                               /*  5 - Reserved      */
    0,                               /*  6 - Reserved      */
    0,                               /*  7 - Reserved      */
    0,                               /*  8 - Reserved      */
    0,                               /*  9 - Reserved      */
    0,                               /* 10 - Reserved      */
    SVC_Handler,                     /* 11 - SVCall        */
    0,                               /* 12 - Reserved      */
    0,                               /* 13 - Reserved      */
    PendSV_Handler,                  /* 14 - PnedSV        */
    SysTick_Handler,                 /* 15 - SysTick       */
    /* ICU interrupt */              /* @suppress("Block comment") */ /* @suppress("Non-block comment") */
    IEL0_IRQHandler,                 /* 16 - Interrupt  0  */
    IEL1_IRQHandler,                 /* 17 - Interrupt  1  */
    IEL2_IRQHandler,                 /* 18 - Interrupt  2  */
    IEL3_IRQHandler,                 /* 19 - Interrupt  3  */
    IEL4_IRQHandler,                 /* 20 - Interrupt  4  */
    IEL5_IRQHandler,                 /* 21 - Interrupt  5  */
    IEL6_IRQHandler,                 /* 22 - Interrupt  6  */
    IEL7_IRQHandler,                 /* 23 - Interrupt  7  */
    IEL8_IRQHandler,                 /* 24 - Interrupt  8  */
    IEL9_IRQHandler,                 /* 25 - Interrupt  9  */
    IEL10_IRQHandler,                /* 26 - Interrupt 10  */
    IEL11_IRQHandler,                /* 27 - Interrupt 11  */
    IEL12_IRQHandler,                /* 28 - Interrupt 12  */
    IEL13_IRQHandler,                /* 29 - Interrupt 13  */
    IEL14_IRQHandler,                /* 30 - Interrupt 14  */
    IEL15_IRQHandler,                /* 31 - Interrupt 15  */
    IEL16_IRQHandler,                /* 32 - Interrupt 16  */
    IEL17_IRQHandler,                /* 33 - Interrupt 17  */
    IEL18_IRQHandler,                /* 34 - Interrupt 18  */
    IEL19_IRQHandler,                /* 35 - Interrupt 19  */
    IEL20_IRQHandler,                /* 36 - Interrupt 20  */
    IEL21_IRQHandler,                /* 37 - Interrupt 21  */
    IEL22_IRQHandler,                /* 38 - Interrupt 22  */
    IEL23_IRQHandler,                /* 39 - Interrupt 23  */
    IEL24_IRQHandler,                /* 40 - Interrupt 24  */
    IEL25_IRQHandler,                /* 41 - Interrupt 25  */
    IEL26_IRQHandler,                /* 42 - Interrupt 26  */
    IEL27_IRQHandler,                /* 43 - Interrupt 27  */
    IEL28_IRQHandler,                /* 44 - Interrupt 28  */
    IEL29_IRQHandler,                /* 45 - Interrupt 29  */
    IEL30_IRQHandler,                /* 46 - Interrupt 30  */
    IEL31_IRQHandler                 /* 47 - Interrupt 31  */
};

#if defined(__ICCARM__)               /* IAR Compiler */
#pragma call_graph_root = "interrupt"
__weak void NMI_Handler( void ) { while (1) {} }
#pragma call_graph_root = "interrupt"
__weak void HardFault_Handler( void ) { while (1) {} }
#pragma call_graph_root = "interrupt"
__weak void MemManage_Handler( void ) { while (1) {} }
#pragma call_graph_root = "interrupt"
__weak void BusFault_Handler( void ) { while (1) {} }
#pragma call_graph_root = "interrupt"
__weak void UsageFault_Handler( void ) { while (1) {} }
#pragma call_graph_root = "interrupt"
__weak void SVC_Handler( void ) { while (1) {} }
#pragma call_graph_root = "interrupt"
__weak void DebugMon_Handler( void ) { while (1) {} }
#pragma call_graph_root = "interrupt"
__weak void PendSV_Handler( void ) { while (1) {} }
#pragma call_graph_root = "interrupt"
__weak void SysTick_Handler( void ) { while (1) {} }

#pragma call_graph_root = "interrupt"
__weak void IEL0_IRQHandler( void ) { while (1) {} }
#pragma call_graph_root = "interrupt"
__weak void IEL1_IRQHandler( void ) { while (1) {} }
#pragma call_graph_root = "interrupt"
__weak void IEL2_IRQHandler( void ) { while (1) {} }
#pragma call_graph_root = "interrupt"
__weak void IEL3_IRQHandler( void ) { while (1) {} }
#pragma call_graph_root = "interrupt"
__weak void IEL4_IRQHandler( void ) { while (1) {} }
#pragma call_graph_root = "interrupt"
__weak void IEL5_IRQHandler( void ) { while (1) {} }
#pragma call_graph_root = "interrupt"
__weak void IEL6_IRQHandler( void ) { while (1) {} }
#pragma call_graph_root = "interrupt"
__weak void IEL7_IRQHandler( void ) { while (1) {} }
#pragma call_graph_root = "interrupt"
__weak void IEL8_IRQHandler( void ) { while (1) {} }
#pragma call_graph_root = "interrupt"
__weak void IEL9_IRQHandler( void ) { while (1) {} }
#pragma call_graph_root = "interrupt"
__weak void IEL10_IRQHandler( void ) { while (1) {} }
#pragma call_graph_root = "interrupt"
__weak void IEL11_IRQHandler( void ) { while (1) {} }
#pragma call_graph_root = "interrupt"
__weak void IEL12_IRQHandler( void ) { while (1) {} }
#pragma call_graph_root = "interrupt"
__weak void IEL13_IRQHandler( void ) { while (1) {} }
#pragma call_graph_root = "interrupt"
__weak void IEL14_IRQHandler( void ) { while (1) {} }
#pragma call_graph_root = "interrupt"
__weak void IEL15_IRQHandler( void ) { while (1) {} }
#pragma call_graph_root = "interrupt"
__weak void IEL16_IRQHandler( void ) { while (1) {} }
#pragma call_graph_root = "interrupt"
__weak void IEL17_IRQHandler( void ) { while (1) {} }
#pragma call_graph_root = "interrupt"
__weak void IEL18_IRQHandler( void ) { while (1) {} }
#pragma call_graph_root = "interrupt"
__weak void IEL19_IRQHandler( void ) { while (1) {} }
#pragma call_graph_root = "interrupt"
__weak void IEL20_IRQHandler( void ) { while (1) {} }
#pragma call_graph_root = "interrupt"
__weak void IEL21_IRQHandler( void ) { while (1) {} }
#pragma call_graph_root = "interrupt"
__weak void IEL22_IRQHandler( void ) { while (1) {} }
#pragma call_graph_root = "interrupt"
__weak void IEL23_IRQHandler( void ) { while (1) {} }
#pragma call_graph_root = "interrupt"
__weak void IEL24_IRQHandler( void ) { while (1) {} }
#pragma call_graph_root = "interrupt"
__weak void IEL25_IRQHandler( void ) { while (1) {} }
#pragma call_graph_root = "interrupt"
__weak void IEL26_IRQHandler( void ) { while (1) {} }
#pragma call_graph_root = "interrupt"
__weak void IEL27_IRQHandler( void ) { while (1) {} }
#pragma call_graph_root = "interrupt"
__weak void IEL28_IRQHandler( void ) { while (1) {} }
#pragma call_graph_root = "interrupt"
__weak void IEL29_IRQHandler( void ) { while (1) {} }
#pragma call_graph_root = "interrupt"
__weak void IEL30_IRQHandler( void ) { while (1) {} }
#pragma call_graph_root = "interrupt"
__weak void IEL31_IRQHandler( void ) { while (1) {} }

