Jchisholm204/Gentry/STM32_reference/embos/template_f4/BoardSupport/Renesas/R7F0E01_RE01_256KB/DeviceSupport/startup_RE01_256KB.c
#pragma call_graph_root = "interrupt"
/*------------------------------------------------------------------------------
 * Forced placement of unreferenced functions and data
 *----------------------------------------------------------------------------*/
#pragma required=__vector_table

#elif defined(__GNUC__)                  /* GCC Compiler */

/* Function Name : Default_Handler */
/*********************************************************************************************************************//**
 * @brief  Default exception handler.
 * @param[in]  None
 * @param[out]  None
 * @retval None
 ***********************************************************************************************************************/
void Default_Handler (void)              /* @suppress("Source line ordering") */ /* @suppress("Function declaration") */ /* @suppress("Non-API function naming") */
{
    while (1)
    {
        ;                                /* loop */
    }
}  /* End of function Default_Handler() */

void NMI_Handler( void )        __attribute__ ((weak, alias("Default_Handler"))); /* @suppress("Internal function declaration") */
void HardFault_Handler( void )  __attribute__ ((weak, alias("Default_Handler"))); /* @suppress("Internal function declaration") */
void MemManage_Handler( void )  __attribute__ ((weak, alias("Default_Handler"))); /* @suppress("Internal function declaration") */
void BusFault_Handler( void )   __attribute__ ((weak, alias("Default_Handler"))); /* @suppress("Internal function declaration") */
void UsageFault_Handler( void ) __attribute__ ((weak, alias("Default_Handler"))); /* @suppress("Internal function declaration") */
void SVC_Handler( void )        __attribute__ ((weak, alias("Default_Handler"))); /* @suppress("Internal function declaration") */
void DebugMon_Handler( void )   __attribute__ ((weak, alias("Default_Handler"))); /* @suppress("Internal function declaration") */
void PendSV_Handler( void )     __attribute__ ((weak, alias("Default_Handler"))); /* @suppress("Internal function declaration") */
void SysTick_Handler( void )    __attribute__ ((weak, alias("Default_Handler"))); /* @suppress("Internal function declaration") */

void IEL0_IRQHandler( void )    __attribute__ ((weak, alias("Default_Handler"))); /* @suppress("Internal function declaration") */
void IEL1_IRQHandler( void )    __attribute__ ((weak, alias("Default_Handler"))); /* @suppress("Internal function declaration") */
void IEL2_IRQHandler( void )    __attribute__ ((weak, alias("Default_Handler"))); /* @suppress("Internal function declaration") */
void IEL3_IRQHandler( void )    __attribute__ ((weak, alias("Default_Handler"))); /* @suppress("Internal function declaration") */
void IEL4_IRQHandler( void )    __attribute__ ((weak, alias("Default_Handler"))); /* @suppress("Internal function declaration") */
void IEL5_IRQHandler( void )    __attribute__ ((weak, alias("Default_Handler"))); /* @suppress("Internal function declaration") */
void IEL6_IRQHandler( void )    __attribute__ ((weak, alias("Default_Handler"))); /* @suppress("Internal function declaration") */
void IEL7_IRQHandler( void )    __attribute__ ((weak, alias("Default_Handler"))); /* @suppress("Internal function declaration") */
void IEL8_IRQHandler( void )    __attribute__ ((weak, alias("Default_Handler"))); /* @suppress("Internal function declaration") */
void IEL9_IRQHandler( void )    __attribute__ ((weak, alias("Default_Handler"))); /* @suppress("Internal function declaration") */
void IEL10_IRQHandler( void )   __attribute__ ((weak, alias("Default_Handler"))); /* @suppress("Internal function declaration") */
void IEL11_IRQHandler( void )   __attribute__ ((weak, alias("Default_Handler"))); /* @suppress("Internal function declaration") */
void IEL12_IRQHandler( void )   __attribute__ ((weak, alias("Default_Handler"))); /* @suppress("Internal function declaration") */
void IEL13_IRQHandler( void )   __attribute__ ((weak, alias("Default_Handler"))); /* @suppress("Internal function declaration") */
void IEL14_IRQHandler( void )   __attribute__ ((weak, alias("Default_Handler"))); /* @suppress("Internal function declaration") */
void IEL15_IRQHandler( void )   __attribute__ ((weak, alias("Default_Handler"))); /* @suppress("Internal function declaration") */
void IEL16_IRQHandler( void )   __attribute__ ((weak, alias("Default_Handler"))); /* @suppress("Internal function declaration") */
void IEL17_IRQHandler( void )   __attribute__ ((weak, alias("Default_Handler"))); /* @suppress("Internal function declaration") */
void IEL18_IRQHandler( void )   __attribute__ ((weak, alias("Default_Handler"))); /* @suppress("Internal function declaration") */
void IEL19_IRQHandler( void )   __attribute__ ((weak, alias("Default_Handler"))); /* @suppress("Internal function declaration") */
void IEL20_IRQHandler( void )   __attribute__ ((weak, alias("Default_Handler"))); /* @suppress("Internal function declaration") */
void IEL21_IRQHandler( void )   __attribute__ ((weak, alias("Default_Handler"))); /* @suppress("Internal function declaration") */
void IEL22_IRQHandler( void )   __attribute__ ((weak, alias("Default_Handler"))); /* @suppress("Internal function declaration") */
void IEL23_IRQHandler( void )   __attribute__ ((weak, alias("Default_Handler"))); /* @suppress("Internal function declaration") */
void IEL24_IRQHandler( void )   __attribute__ ((weak, alias("Default_Handler"))); /* @suppress("Internal function declaration") */
void IEL25_IRQHandler( void )   __attribute__ ((weak, alias("Default_Handler"))); /* @suppress("Internal function declaration") */
void IEL26_IRQHandler( void )   __attribute__ ((weak, alias("Default_Handler"))); /* @suppress("Internal function declaration") */
void IEL27_IRQHandler( void )   __attribute__ ((weak, alias("Default_Handler"))); /* @suppress("Internal function declaration") */
void IEL28_IRQHandler( void )   __attribute__ ((weak, alias("Default_Handler"))); /* @suppress("Internal function declaration") */
void IEL29_IRQHandler( void )   __attribute__ ((weak, alias("Default_Handler"))); /* @suppress("Internal function declaration") */
void IEL30_IRQHandler( void )   __attribute__ ((weak, alias("Default_Handler"))); /* @suppress("Internal function declaration") */
void IEL31_IRQHandler( void )   __attribute__ ((weak, alias("Default_Handler"))); /* @suppress("Internal function declaration") */

