Jchisholm204/Gentry/STM32_reference/embos/template_f4/BoardSupport/Renesas/R7F0E01_RE01_256KB/DeviceSupport/startup_RE01_256KB.c
#else                                    /* @suppress("Conditional directive comment") */
#endif

/***************************************************************************//**
* @brief  Processing after reset.
* @param  None
* @retval None
*******************************************************************************/
void Reset_Handler( void )               /* @suppress("Function description comment") */ /* @suppress("Non-static function declaration location") */ /* @suppress("Non-API function naming") */
{
    SystemInit();

#if defined(__ICCARM__)                  /* IAR Compiler */
    __iar_program_start();
#elif defined(__GNUC__)                  /* GCC Compiler */
    uint32_t  bytes;
    uint8_t * pstart  = (uint8_t *)&__bss_start__;  /* @suppress("Local pointer variable naming") */ /* @suppress("Cast comment") */
    uint8_t * psource = (uint8_t *)&__etext;        /* @suppress("Local pointer variable naming") */ /* @suppress("Cast comment") */
    uint8_t * pdest   = (uint8_t *)&__data_start__; /* @suppress("Local pointer variable naming") */ /* @suppress("Cast comment") */

    /* Zero out BSS */
    bytes = (uint32_t)&__bss_end__ - (uint32_t)&__bss_start__;
    while (bytes > (uint32_t)0)          /* @suppress("Cast comment") */ /* @suppress("while statement braces") */
    {
        bytes--;
        pstart[bytes] = (uint32_t)0;     /* @suppress("Cast comment") */
    }

    /* Copy initialized RAM data from ROM to RAM. */
    bytes = (uint32_t)&__data_end__ - (uint32_t)&__data_start__;
    for (uint32_t index = 0U; index < bytes; index++, pdest++, psource++)
    {
        *pdest = *psource;
    }

    main();
#else
#endif
} /* End of function Reset_Handler() */

/*******************************************************************************************************************//**
 * @} (end addtogroup grp_cmsis_core)
 **********************************************************************************************************************/

/* End of file (startup_RE01_256KB.c) */
